Table of Contents
 Class ProjectContentClientHandler
Namespace
IdeaStatiCa.Plugin.ProjectContent
Assembly
IdeaStatiCa.Plugin.dll
Implementation of IdeaStatiCa.Public.IProjectContent for accessing project data of using grpc
public class ProjectContentClientHandler : GrpcMethodInvokerHandler, IMethodInvoker, IGrpcMessageHandler, IProjectContent, IProjectContentStorage
Inheritance
object
GrpcMethodInvokerHandler
ProjectContentClientHandler
Implements
IMethodInvoker
IGrpcMessageHandler
IProjectContent
IProjectContentStorage
Inherited Members
 GrpcMethodInvokerHandler.HandlerName
 GrpcMethodInvokerHandler.GrpcSender
 GrpcMethodInvokerHandler.InvokeMethod<T>(string, Type, params object[])
 GrpcMethodInvokerHandler.SendMessageDataSync(GrpcMessage)
 GrpcMethodInvokerHandler.HandleServerMessage(GrpcMessage, IGrpcSender)
 GrpcMethodInvokerHandler.HandleClientMessage(GrpcMessage, IGrpcSender)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ProjectContentClientHandler(IGrpcSender, IPluginLogger)
Constructor
public ProjectContentClientHandler(IGrpcSender client, IPluginLogger logger)
Parameters
client IGrpcSender
Grpc client
logger IPluginLogger
Methods
 CopyContent(IProjectContent)
Not implemented
public void CopyContent(IProjectContent sourceContent)
Parameters
sourceContent IProjectContent
 Create(string)
Not implemented
public Stream Create(string contentId)
Parameters
contentId string
Returns
Stream
 Delete(string)
Invoke method 'Delete' remotely
public void Delete(string contentId)
Parameters
contentId string
Id of the item to delete
 Exist(string)
Invoke method 'Exist' remotely
public bool Exist(string contentId)
Parameters
contentId string
Id of the project item
Returns
bool
OK
 Get(string)
public Stream Get(string contentId)
Parameters
contentId string
Returns
Stream
 GetContent()
Get project content by invoging remote method 'GetContent' using GrpcClient
public List<ProjectDataItem> GetContent()
Returns
List<ProjectDataItem>
List of all project items
 ReadData(string, Stream)
Get requested contentId by invoking remote method 'Read' by GrpcClient and write them to outputStream
public int ReadData(string contentId, Stream outputStream)
Parameters
contentId string
valid Id of the requested project content.
outputStream Stream
Open Stream for witing to store result.
Returns
int
Always 1
Exceptions
Exception
Exception is thrown if the operation fails
 WriteData(string, Stream)
Invoke remote method 'Write' which writes data remotely.
public int WriteData(string contentId, Stream inputStream)
Parameters
contentId string
Name of the project item
inputStream Stream
Returns
int
Always 1
Exceptions
Exception
Exception is thrown if the operation fails
 Edit this page